export default {
    //支付类型
    payType: {
        "WXPAY": "微信支付",
        "ALIPAY": "支付宝支付",
        "MPAY": '会员支付'
    },
    roles: ['总部 ', '门店 ', '员工 ', '店长'],
    couponType: {
        '0': '代金券',
        '1': '折扣券',
        '2': '兑换券',
        '5': '单品代金券',
        '6': '会员卡',
        '7': '单品折扣',
        '8': '单品特价券',
        '9': '全场满减券',
        '-1': '单品券',
        '-2': '全场券'
    },
    orderStatus: {
        'NOTPAY': '未支付',
        'SUCCESS': '已完成',
        'REFUND': '转入退款',
        'CLOSED': '已关闭',
        'REVOKED': '已撤销',
        'PAYERROR': '失败'
    },
    orderSource: ['支付码','收款插件','APP','接口','银行卡','小程序','押金'],
    orderStatusSel: ['全部支付状态', '未支付', '已完成', '已退款', '已关闭', '已撤销'],
    payTypeSel: ['全部支付方式', '微信', '支付宝', '会员'],
    accountStatus:["待打款","打款成功","打款失败"]
}