Page({
  data: {
    notes: null,
    agreement: [
      {
        title: '1. 服务内容',
        classB: [
          {text: '1.1 本服务协议中的“产品和/或服务”指：联拓数科向您提供的联拓数科服务商助手CRM 产品和/或服务，具体服务内容以您所使用或订购的内容为准。'},
          {text: '1.2 联拓数科保留随时变更、中止或终止部分免费服务的权利，并保留根据实际情况随时调整联拓数科提供的免费服务种类、形式的权利，联拓数科不承担因联拓数科服务商助手CRM提供的任何免费服务的调整给您造成的损失。联拓数科将尽合理的努力给您预留合理的时间以便您为该等服务变更、中止或终止做出应对。'}
        ]
      },
      {
        title: '2. 注册',
        classB: [
          {text: '2.1 为了能访问联拓数科服务商助手CRM和使用服务，您同意以下事项：依联拓数科官网提示填写准确的、真实的姓名、注册邮箱、企业名称、手机号，并确保今后更新的登录邮箱、手机号、企业名称等资料的有效性和合法性。若您提供任何违法、虚假、不道德或联拓数科认为不适合在联拓数科服务商助手CRM上展示的资料，或者联拓数科服务商助手有理由怀疑您的资料属于病毒程序或恶意操作，或者您违反本服务协议的规定，联拓数科有权暂停或终止您的帐号，并拒绝您于现在和未来使用服务之全部或任何部分。'},
          {
            hasClass: true,
            text: [
              {text: '2.2 '},
              {text: '尽管有前述规定，联拓数科无义务对任何用户的任何登记资料承担任何责任，包括但不限于鉴别、核实任何登记资料的真实性、准确性、完整性、适用性及/或是否为最新资料的责任。', class: 'weight'}
            ],
          }
        ]
      },
      {
        title: '3. 您的权利、义务',
        classB: [
          {text: '3.1 您同意遵守本服务协议以及联拓数科官网所列的相关管理规范及流程。'},
          {text: '3.2 您或您代表的机构完全拥有在使用联拓数科服务商助手CRM服务时录入的数据和资料（包括但不限于客户资料、联系人、文档、沟通信息）的所有权，并对数据和资料的准确性、安全性与合法性负责，不得违反个人信息保护的相关规定。'},
          {text: '3.3 您承诺，如果您利用联拓数科服务商助手CRM服务开展的经营活动需要获得国家有关部门许可或批准的，必须提前获得相关许可或批准。联拓数科对您经营活动所需要的相关许可或批准不承担任何责任。'},
          {
            text: '3.4 您承诺，不得利用联拓数科服务商助手CRM提供的资源和服务上传、下载、存储、发布、传播任何法律、法规和政策禁止的内容，不为他人发布该等信息提供任何便利（包括但不限于设置URL、BANNER连接等），该等信息包括但不限于：',
            classC: [
              '3.4.1 反对宪法所确定的基本原则的信息；',
              '3.4.2 危害国家安全、泄露国家秘密、颠覆国家政权、破坏国家统一的信息；',
              '3.4.3 损害国家荣誉和利益的信息；',
              '3.4.4 违反国家民族和宗教政策的信息；',
              '3.4.5 散布谣言，扰乱社会秩序，破坏社会稳定的信息；',
              '3.4.6 散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的信息；',
              '3.4.7 妨碍互联网运行安全的信息；',
              '3.4.8 侮辱或者诽谤他人，侵害他人合法权益的信息和/或其他有损于社会秩序、社会治安、公共道德的信息或内容；',
              '3.4.9 其他违反法律法规、部门规章或国家政策的信息。'
            ]
          },
          {
            text: '3.5 您承诺，不得利用联拓数科服务商助手CRM产品和/或服务进行如下行为：',
            classC: [
              '3.5.1 发送骚扰、垃圾广告或信息的；',
              '3.5.2 散布、发送涉及他人隐私、个人信息或资料的；',
              '3.5.3 利用联拓数科服务商助手CRM从事任何违法犯罪活动的；',
              '3.5.4 对联拓数科服务商助手CRM产品进行了任何形式的对其他第三方的再授权使用、销售或转让；',
              '3.5.5 您只处于您个人或公司商业范围内使用服务，禁止发送兜售信息和违反法律的信息，禁止发送和存储带有病毒的、蠕虫的、木马的和其他有害的计算机代码、文件、脚本和程序。',
              '3.5.6 任何危害或试图危害网络安全的行为（包括但不限于钓鱼、非法入侵、网络诈骗、网站或空间中含有涉嫌散播病毒、木马、恶意代码，以及通过虚拟主机对其他网站、主机进行涉嫌攻击行为）；',
              '3.5.7 任何改变或试图改变联拓数科服务商助手CRM提供的系统配置或破坏系统安全的行为；',
              '3.5.8 为设计开发竞争产品对联拓数科服务商助手CRM进行任何形式的反向工程，或复制模仿联拓数科服务商助手CRM的设计理念、界面、功能和图表；',
              '3.5.9 其他违反法律法规规定、侵犯其他用户合法权益、违反本服务协议、干扰联拓数科服务商助手CRM产品和/或服务未明示授权的行为。'
            ]
          },
          {text: '3.6 如果您使用联拓数科服务商助手CRM从事上述3.5及3.6条的行为，联拓数科有权根据情况采取相应的处理措施，包括但不限于随时停止服务和/或删除相应数据、信息等，并要求您赔偿由此造成的损失。'},
          {text: '3.7 您须依照《互联网信息服务管理办法》、《互联网电子公告服务管理规定》等法律法规的规定保留自己网站的访问日志记录，包括发布的信息内容及其发布时间、互联网地址（IP）、域名等，国家有关机关依法查询时应配合提供。您自行承担未按规定保留相关记录而引起的全部法律责任。'},
          {text: '3.8 您应对您的账号下所发生的任何行为负责并遵守地方、国家所有与本服务协议有关的适用的法律、法规。'},
          {text: '3.9 您了解联拓数科服务商助手CRM无法保证其所提供的产品和/或服务毫无瑕疵，同时联拓数科服务商助手CRM承诺不断提升服务质量与服务水平。您同意，即使联拓数科服务商助手CRM提供的产品和/或服务存在瑕疵，且上述瑕疵是当时行业技术水平所无法避免的，其将不视为联拓数科违约。'}
        ]
      },
      {
        title: '4. 联拓数科的权利义务',
        classB: [
          {text: '4.1 联拓数科按照本服务协议约定提供服务。'},
          {text: '4.2 联拓数科严格遵守保密义务。'}
        ]
      },
      {
        title: '5. 知识产权',
        classB: [
          {text: '5.1 联拓数科完全拥有联拓数科服务商助手CRM产品及服务（包括对其进行的任何开发和升级）的所有权及所有相关的知识产权（包括但不限于源代码、目标代码、文档资料、界面设计、版面框架、LOGO、以及任何由联拓数科服务商助手根据维护与技术支持提供的软件、资料等）。您认同联拓数科拥有的所有权及知识产权，并承诺尊重及不以任何方式侵害联拓数科服务商助手的所有权及知识产权。未经联拓数科的事先书面许可，您不得复制、传播、转让、许可或提供他人使用上述知识成果，否则应承担相应的法律责任。'},
          {text: '5.2 您应保证提交给联拓数科服务商助手CRM的信息内容，对联拓数科服务商助手CRM服务的使用及使用联拓数科服务商助手CRM服务所产生的成果未侵犯任何第三方的合法权益。如有第三方基于侵犯知识产权、侵犯第三人之权益或违反中国法律法规或其他适用的法律等原因而向联拓数科服务商助手CRM提起索赔、诉讼或可能向其提起诉讼,则您应赔偿联拓数科因此承担的费用或损失，并使联拓数科完全免责。'},
          {text: '5.3如果第三方机构或个人对您使用联拓数科服务商助手CRM服务及其相关信息内容的知识产权归属提出质疑或投诉，您有责任出具相关知识产权证明材料，并配合联拓数科相关投诉处理工作。'},
          {text: '5.4 您在联拓数科服务商助手CRM平台创建的独创性数据归您所有，您有权对您所创建的数据进行任何形式的处置，包括从平台中复制、导出和删除。'},
        ]
      },
      {
        title: '6. 用户数据的保存、销毁与下载',
        classB: [
          {text: '6.1 使用联拓数科服务商助手CRM提供的服务，即表示您同意联拓数科合法收集和使用有关您及您所使用服务的技术性或诊断性信息。收集到的这些信息将用于提供、改进联拓数科服务商助手CRM产品的内容和技术，提升联拓数科服务商助手的服务品质。'},
          {text: '6.2 联拓数科将尽合理的努力保护您的信息安全，并为此采取合理的数据传输、存储、转换等预防保护措施。但是，互联网数据传输、存储、转换均可能存在一定未知且不确定的数据安全风险，该等风险将导致包括但不限于数据丢失、泄露、损坏、无法读取或提取等后果。您确认，您已明确知晓并同意接受该等因互联网引发的风险和后果，并已采取恰当的措施（例如数据备份等），以便在该等风险发生时将损失降至最低。'},
          {
            text: '6.3 联拓数科不会将您的信息和内容提供给其他的组织或个人，但以下情况除外：',
            classC: [
              '6.3.1 经您事先同意或授权，向第三方披露；',
              '6.3.2 司法机关或有权政府机构或任何法律法规部门规章要求联拓数科提供该等信息；',
              '6.3.3 如您违反了国家有关法律法规，需要向第三方披露；',
              '6.3.4 如您违反了本服务协议，且联拓数科出于维权需要向第三方提供的。',
            ]
          },
        ]
      },
      {
        title: '7. 保密条款',
        classB: [
          {text: '7.1 保密信息指由一方向另一方披露的所有技术及非技术信息（包括但不限于产品资料、产品计划、价格、财务及营销规划、业务战略、客户信息、客户数据、研发、软件硬件、API应用数据接口、技术说明、设计、特殊公式、特殊算法等）。'},
          {text: '7.2. 本服务协议任何一方同意对获悉的对方之上述保密信息予以保密，并严格限制接触上述保密信息的员工遵守本条之保密义务。除非国家机关依法强制要求或上述保密信息已经进入公有领域外，接受保密信息的一方不得对外披露。'},
          {text: '7.3. 本服务协议双方明确认可各自用户信息和业务数据等是各自的重要资产及重点保密信息。本服务协议双方同意尽最大的努力保护上述保密信息等不被披露。一旦发现有上述保密信息泄露事件，双方应合作采取一切合理措施避免或者减轻损害后果的产生。'},
          {text: '7.4. 本条款不因本服务协议的终止而失效。'}
        ]
      },
      {
        title: '8. 免责声明',
        classB: [
          {
            text: '8.1 您知悉并同意，下列情况下，联拓数科无需向您承担任何责任：',
            classC: [
              '8.1.1 由于您维护不当或保密不当，导致数据、资料、口令、密码等丢失或泄漏，或其他非因联拓数科原因导致的个人信息的泄漏；',
              '8.1.2 任何由于不可抗力、黑客攻击、电脑病毒侵入、网络运营商、第三方服务商原因或政府管制等联拓数科无法合理控制的原因而造成联拓数科服务商助手CRM使用中止、中断、延误、使用限制、使用异常、使用不能、暂时性关闭等；',
              {
                hasClass: true,
                text: [
                  {text: '8.1.3 您理解并确认，受技术所限，联拓数科无法保证其所提供的服务毫无瑕疵，但我们承诺将不断提升服务质量及服务水平，为您提供更加优质的服务。据此，您同意：'},
                  {text: '如果联拓数科所提供的服务虽然存在瑕疵，但该等瑕疵是当时行业技术水平所无法避免的，其将不被视为违约，联拓数科无须因此向您承担任何责任。', class: 'weight'}
                ]
              }
            ]
          }
        ]
      },
      {
        title: '9. 服务变更、中断和终止',
        classB: [
          {text: '9.1 如因系统维护或升级的需要而暂停网络服务、调整服务功能的，联拓数科将尽可能事先在网站或联拓数科服务商助手CRM系统上进行通告。'},
          {
            text: '9.2 发生下列情形，服务期限提前终止：',
            classC: [
              '9.2.1 双方协商一致提前终止的；',
              '9.2.2 您严重违反本服务协议（包括但不限于您未按照协议约定履行付款义务、及/或您严重违反法律法规规定等），联拓数科有权提前终止服务，并不退还您已经支付的费用；'
            ]
          },
          {text: '9.3 您理解并认可，虽然联拓数科已采取（并将根据技术的发展不断完善）必要的技术措施防御包括计算机病毒、网络入侵等危害网络安全的行为及事项，但鉴于网络安全技术的局限性、相对性以及该等行为的不可预见性，如因您网站遭遇该等危害网络安全的行为而给联拓数科服务商助手CRM带来危害，联拓数科可单方面决定暂停或终止服务，不承担任何违约责任。'},
        ]
      },
      {
        title: '10. 违约责任',
        classB: [
          {text: '10.1 本服务协议任何一方违反本服务协议的条款均需依法承担违约责任。'},
          {text: '10.2 您理解并同意，因您违反本服务协议的规定或利用本服务从事任何违法或侵权行为，导致或产生第三方主张的任何索赔、要求或损失，您应当独立承担一切责任；联拓数科因此遭受损失的，您也应当一并赔偿。'},
          {
            text: '10.3 您理解，由于计算机、互联网的特殊性，下列情况不属于联拓数科违约：',
            classC: [
              '10.3.1 联拓数科服务商助手CRM在进行服务器配置、维护时，需要短时间中断服务；',
              '10.3.2 联拓数科服务商助手CRM可能因互联网和电子通信固有的缺陷而产生限制、延迟和其它问题；',
              '10.3.3联拓数科服务商助手CRM因计算机、互联网特性且不可归责于公司的原因可能会造成用户损失的情况。'
            ]
          },
        ]
      },
      {
        title: '11．不可抗力',
        classB: [
          {text: '11.1 因不可抗力事件，使得本服务协议的履行不可能、不必要或者无意义的，遭受不可抗力的一方不承担责任。'},
          {text: '11.2 不可抗力是指不能预见、不能克服并不能避免且对一方或双方当事人造成重大影响的客观事件，包括但不限于传染性疾病、水灾、火灾、旱灾、风灾、地震、其它自然灾害、罢工、骚动、暴乱及战争（不论是否宣战）以及政府部门的作为及不作为、电信主干路中断等。'},
        ]
      },
      {
        title: '12. 法律适用及争议解决',
        classB: [
          {text: '12.1 本服务协议的订立、效力、解释、履行、修改、终止以及争议解决均适用中华人民共和国法律法规。'},
          {
            hasClass: true,
            text: [
              {text: '因履行本服务协议发生争议的，双方应及时协商解决。协商不成的，任何一方有权向'},
              {text: '联拓数科所在地的人民法院', class: 'weight'},
              {text: '提起诉讼。'},
            ],
          }
        ]
      },
      {
        title: '13. 其他',
        classB: [
          {text: '13.1 联拓数科有权根据互联网的发展和中华人民共和国有关法律、法规的变化，不时地完善和修改联拓数科服务商助手CRM服务协议。联拓数科保留随时修改服务协议的权利，当发生相关争议时，以最新的服务协议为准。'},
          {text: '13.2本服务协议未尽事宜，由双方另行签订合同约定，其所列条款内容将构成本服务协议不可分割的部分。如双方另行签订的合同所列条款与本服务协议所列条款内容有不一致之处，以双方另行签订的合同为准。'},
          {text: '13.3 联拓数科拥有本服务协议的最终解释权。'},
        ]
      },
    ]
  },

  onLoad(options) {
    this.setData({notes: options.notes})
  },

  onReady() {
    wx.setNavigationBarTitle({title: `${this.data.notes === 'agreement' ? '联拓数科服务商协议' : '名词解释'}`})
  }
})
